### Import Pandas Library

In [1]:
import pandas as pd

### Read data from provided CSV file

In [2]:
df = pd.read_csv('tips.csv')

### Display the type of Data

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

### Display columns of Data Frame

In [4]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

### Extract and display the first few rows of the following columns 
    - Total_Bill
    - Tip
    - Sex

In [5]:
features = ['total_bill', 'tip', 'sex']
df[features].head()

   total_bill   tip     sex
0       16.99  1.01  Female
1       10.34  1.66    Male
2       21.01  3.50    Male
3       23.68  3.31    Male
4       24.59  3.61  Female

### Display and Sort values of Day and Total_Bill in Descending Order

In [6]:
df[['day', 'total_bill']].sort_values(by=['day', 'total_bill'], ascending=False)

      day  total_bill
197  Thur       43.11
142  Thur       41.19
85   Thur       34.83
141  Thur       34.30
83   Thur       32.68
..    ...         ...
97    Fri       12.03
100   Fri       11.35
226   Fri       10.09
222   Fri        8.58
92    Fri        5.75

[244 rows x 2 columns]

### Display Unique Days from Data

In [7]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

### Change the Value of Tip in Second Row to '2' and Display the Data

In [8]:
df['tip']

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [9]:
df.loc[2, 'tip'] = 2

In [10]:
df['tip'].head()

0    1.01
1    1.66
2    2.00
3    3.31
4    3.61
Name: tip, dtype: float64

### Add new column "TOTAL" = Total Bill + Tip

In [11]:
df['TOTAL'] = df['total_bill'] + df['tip']

In [12]:
df['TOTAL']

0      18.00
1      12.00
2      23.01
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Name: TOTAL, Length: 244, dtype: float64

### Store the names of columns in "Cols" variable

In [13]:
Cols = df.columns
Cols

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size', 'TOTAL'], dtype='object')

### Create a List (tmp) of Column in following order
### 6, 2, 4, 5

In [14]:
temp = df.iloc[:, [6, 2, 4, 5]]
temp = temp.columns
temp

Index(['size', 'sex', 'day', 'time'], dtype='object')

### Create a new Dataframe with Columns from 'Tmp'

In [15]:
df1 = df[temp]

In [16]:
df1.head()

   size     sex  day    time
0     2  Female  Sun  Dinner
1     3    Male  Sun  Dinner
2     3    Male  Sun  Dinner
3     2    Male  Sun  Dinner
4     4  Female  Sun  Dinner